IDEA Open Model
LoadCase.StrainLoadsOnLine Property
Compatible with IDEA StatiCa v 10.1
 List of generalized strain load impulses along the line in this load case.
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<ReferenceElement> StrainLoadsOnLine { get; set; }
Public Property StrainLoadsOnLine As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ StrainLoadsOnLine {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Loading Namespace